app/views/pictures/index.html.erb

      <h3> Comments for <%= picture.title %></h3>
        <p><%= pluralize picture.likes.count, 'likes' %></p>
        <% if picture.comments.any? %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."picture_id" = $1  [["picture_id", 1]]
SELECT  1 AS one FROM "comments" WHERE "comments"."picture_id" = $1 LIMIT 1  [["picture_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = $1  [["picture_id", 2]]