app/controllers/comments_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @picture = Picture.find(params[:picture_id])

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("comment", "picture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "ecco"], ["picture_id", 2], ["created_at", "2015-06-21 08:40:14.989872"], ["updated_at", "2015-06-21 08:40:14.989872"]]
---
  def create
    @picture = Picture.find(params[:picture_id])
    @picture.comments.create(review_params)