app/controllers/likes_controller.rb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "likes" ("user_id", "picture_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["picture_id", 1], ["created_at", "2015-06-21 14:53:00.450908"], ["updated_at", "2015-06-21 14:53:00.450908"]]
---
  def create
    @picture = Picture.find(params[:picture_id])
    @picture.likes.create(user_id: current_user)