app/controllers/pictures_controller.rb

  def create
    current_user.pictures.create(picture_params)
---
INSERT INTO "pictures" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "at the sea"], ["created_at", "2015-06-20 17:47:36.780158"], ["updated_at", "2015-06-20 17:47:36.780158"]]